mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1c3xc/common/s6e1c3xc.h
/*******************************************************************************
* HWWDT Registers HWWDT
*   Register Definition
*******************************************************************************/
#define FM_HWWDT_WDG_LDR                          *((volatile uint32_t*)(0x40011000UL))
#define FM0P_HWWDT_WDG_LDR                        *((volatile uint32_t*)(0x40011000UL))
#define FM_HWWDT_WDG_VLR                          *((volatile uint32_t*)(0x40011004UL))
#define FM0P_HWWDT_WDG_VLR                        *((volatile uint32_t*)(0x40011004UL))
#define FM_HWWDT_WDG_CTL                          *((volatile uint32_t*)(0x40011008UL))
#define FM0P_HWWDT_WDG_CTL                        *((volatile uint32_t*)(0x40011008UL))
#define FM_HWWDT_WDG_ICL                          *((volatile uint32_t*)(0x4001100CUL))
#define FM0P_HWWDT_WDG_ICL                        *((volatile uint32_t*)(0x4001100CUL))
#define FM_HWWDT_WDG_RIS                          *((volatile uint32_t*)(0x40011010UL))
#define FM0P_HWWDT_WDG_RIS                        *((volatile uint32_t*)(0x40011010UL))
#define FM_HWWDT_WDG_LCK                          *((volatile uint32_t*)(0x40011C00UL))
#define FM0P_HWWDT_WDG_LCK                        *((volatile uint32_t*)(0x40011C00UL))

/*******************************************************************************
* I2CSLAVE Registers I2CSLAVE
*   Register Definition
*******************************************************************************/
#define FM_I2CSLAVE_IBSSR                         *((volatile uint16_t*)(0x40037980UL))
#define FM0P_I2CSLAVE_IBSSR                       *((volatile uint16_t*)(0x40037980UL))
#define FM_I2CSLAVE_IBSCR                         *((volatile uint16_t*)(0x40037982UL))
#define FM0P_I2CSLAVE_IBSCR                       *((volatile uint16_t*)(0x40037982UL))
#define FM_I2CSLAVE_IBSADR                        *((volatile  uint8_t*)(0x40037984UL))
#define FM0P_I2CSLAVE_IBSADR                      *((volatile  uint8_t*)(0x40037984UL))
#define FM_I2CSLAVE_IBSMSKR                       *((volatile  uint8_t*)(0x40037985UL))
#define FM0P_I2CSLAVE_IBSMSKR                     *((volatile  uint8_t*)(0x40037985UL))
#define FM_I2CSLAVE_IBSDSTUPR                     *((volatile  uint8_t*)(0x40037986UL))
#define FM0P_I2CSLAVE_IBSDSTUPR                   *((volatile  uint8_t*)(0x40037986UL))
#define FM_I2CSLAVE_IBSTDR                        *((volatile  uint8_t*)(0x40037988UL))
#define FM0P_I2CSLAVE_IBSTDR                      *((volatile  uint8_t*)(0x40037988UL))
#define FM_I2CSLAVE_IBSRDR                        *((volatile  uint8_t*)(0x4003798CUL))
#define FM0P_I2CSLAVE_IBSRDR                      *((volatile  uint8_t*)(0x4003798CUL))
#define FM_I2CSLAVE_IBSSCR                        *((volatile uint16_t*)(0x40037990UL))
#define FM0P_I2CSLAVE_IBSSCR                      *((volatile uint16_t*)(0x40037990UL))
#define FM_I2CSLAVE_IBSSSR                        *((volatile uint16_t*)(0x40037994UL))
#define FM0P_I2CSLAVE_IBSSSR                      *((volatile uint16_t*)(0x40037994UL))

/*******************************************************************************
* INTREQ Registers INTREQ
*   Register Definition
*******************************************************************************/
#define FM_INTREQ_VIR_OFFSET                      *((volatile uint32_t*)(0x40031008UL))
#define FM0P_INTREQ_VIR_OFFSET                    *((volatile uint32_t*)(0x40031008UL))
#define FM_INTREQ_ODDPKS                          *((volatile  uint8_t*)(0x40031010UL))
#define FM0P_INTREQ_ODDPKS                        *((volatile  uint8_t*)(0x40031010UL))
#define FM_INTREQ_EXC02MON                        *((volatile uint32_t*)(0x40031200UL))
#define FM0P_INTREQ_EXC02MON                      *((volatile uint32_t*)(0x40031200UL))
#define FM_INTREQ_IRQ00MON                        *((volatile uint32_t*)(0x40031204UL))
#define FM0P_INTREQ_IRQ00MON                      *((volatile uint32_t*)(0x40031204UL))
#define FM_INTREQ_IRQ01MON                        *((volatile uint32_t*)(0x40031208UL))
#define FM0P_INTREQ_IRQ01MON                      *((volatile uint32_t*)(0x40031208UL))
#define FM_INTREQ_IRQ02MON                        *((volatile uint32_t*)(0x4003120CUL))
#define FM0P_INTREQ_IRQ02MON                      *((volatile uint32_t*)(0x4003120CUL))
#define FM_INTREQ_IRQ03MON                        *((volatile uint32_t*)(0x40031210UL))
#define FM0P_INTREQ_IRQ03MON                      *((volatile uint32_t*)(0x40031210UL))
#define FM_INTREQ_IRQ04MON                        *((volatile uint32_t*)(0x40031214UL))
#define FM0P_INTREQ_IRQ04MON                      *((volatile uint32_t*)(0x40031214UL))
#define FM_INTREQ_IRQ05MON                        *((volatile uint32_t*)(0x40031218UL))
#define FM0P_INTREQ_IRQ05MON                      *((volatile uint32_t*)(0x40031218UL))
#define FM_INTREQ_IRQ06MON                        *((volatile uint32_t*)(0x4003121CUL))
#define FM0P_INTREQ_IRQ06MON                      *((volatile uint32_t*)(0x4003121CUL))
#define FM_INTREQ_IRQ07MON                        *((volatile uint32_t*)(0x40031220UL))
#define FM0P_INTREQ_IRQ07MON                      *((volatile uint32_t*)(0x40031220UL))
#define FM_INTREQ_IRQ08MON                        *((volatile uint32_t*)(0x40031224UL))
#define FM0P_INTREQ_IRQ08MON                      *((volatile uint32_t*)(0x40031224UL))
#define FM_INTREQ_IRQ09MON                        *((volatile uint32_t*)(0x40031228UL))
#define FM0P_INTREQ_IRQ09MON                      *((volatile uint32_t*)(0x40031228UL))
#define FM_INTREQ_IRQ10MON                        *((volatile uint32_t*)(0x4003122CUL))
#define FM0P_INTREQ_IRQ10MON                      *((volatile uint32_t*)(0x4003122CUL))
#define FM_INTREQ_IRQ11MON                        *((volatile uint32_t*)(0x40031230UL))
#define FM0P_INTREQ_IRQ11MON                      *((volatile uint32_t*)(0x40031230UL))
#define FM_INTREQ_IRQ12MON                        *((volatile uint32_t*)(0x40031234UL))
#define FM0P_INTREQ_IRQ12MON                      *((volatile uint32_t*)(0x40031234UL))
#define FM_INTREQ_IRQ13MON                        *((volatile uint32_t*)(0x40031238UL))
#define FM0P_INTREQ_IRQ13MON                      *((volatile uint32_t*)(0x40031238UL))
#define FM_INTREQ_IRQ14MON                        *((volatile uint32_t*)(0x4003123CUL))
#define FM0P_INTREQ_IRQ14MON                      *((volatile uint32_t*)(0x4003123CUL))
#define FM_INTREQ_IRQ15MON                        *((volatile uint32_t*)(0x40031240UL))
#define FM0P_INTREQ_IRQ15MON                      *((volatile uint32_t*)(0x40031240UL))
#define FM_INTREQ_IRQ16MON                        *((volatile uint32_t*)(0x40031244UL))
#define FM0P_INTREQ_IRQ16MON                      *((volatile uint32_t*)(0x40031244UL))
#define FM_INTREQ_IRQ17MON                        *((volatile uint32_t*)(0x40031248UL))
#define FM0P_INTREQ_IRQ17MON                      *((volatile uint32_t*)(0x40031248UL))
#define FM_INTREQ_IRQ18MON                        *((volatile uint32_t*)(0x4003124CUL))
#define FM0P_INTREQ_IRQ18MON                      *((volatile uint32_t*)(0x4003124CUL))
#define FM_INTREQ_IRQ19MON                        *((volatile uint32_t*)(0x40031250UL))
#define FM0P_INTREQ_IRQ19MON                      *((volatile uint32_t*)(0x40031250UL))
#define FM_INTREQ_IRQ20MON                        *((volatile uint32_t*)(0x40031254UL))
#define FM0P_INTREQ_IRQ20MON                      *((volatile uint32_t*)(0x40031254UL))
#define FM_INTREQ_IRQ21MON                        *((volatile uint32_t*)(0x40031258UL))
#define FM0P_INTREQ_IRQ21MON                      *((volatile uint32_t*)(0x40031258UL))
#define FM_INTREQ_IRQ22MON                        *((volatile uint32_t*)(0x4003125CUL))
#define FM0P_INTREQ_IRQ22MON                      *((volatile uint32_t*)(0x4003125CUL))
#define FM_INTREQ_IRQ23MON                        *((volatile uint32_t*)(0x40031260UL))
#define FM0P_INTREQ_IRQ23MON                      *((volatile uint32_t*)(0x40031260UL))
#define FM_INTREQ_IRQ24MON                        *((volatile uint32_t*)(0x40031264UL))
#define FM0P_INTREQ_IRQ24MON                      *((volatile uint32_t*)(0x40031264UL))
#define FM_INTREQ_IRQ25MON                        *((volatile uint32_t*)(0x40031268UL))
#define FM0P_INTREQ_IRQ25MON                      *((volatile uint32_t*)(0x40031268UL))
#define FM_INTREQ_IRQ26MON                        *((volatile uint32_t*)(0x4003126CUL))
#define FM0P_INTREQ_IRQ26MON                      *((volatile uint32_t*)(0x4003126CUL))
#define FM_INTREQ_IRQ27MON                        *((volatile uint32_t*)(0x40031270UL))
#define FM0P_INTREQ_IRQ27MON                      *((volatile uint32_t*)(0x40031270UL))
#define FM_INTREQ_IRQ28MON                        *((volatile uint32_t*)(0x40031274UL))
#define FM0P_INTREQ_IRQ28MON                      *((volatile uint32_t*)(0x40031274UL))
#define FM_INTREQ_IRQ29MON                        *((volatile uint32_t*)(0x40031278UL))
#define FM0P_INTREQ_IRQ29MON                      *((volatile uint32_t*)(0x40031278UL))
#define FM_INTREQ_IRQ30MON                        *((volatile uint32_t*)(0x4003127CUL))
#define FM0P_INTREQ_IRQ30MON                      *((volatile uint32_t*)(0x4003127CUL))
#define FM_INTREQ_IRQ31MON                        *((volatile uint32_t*)(0x40031280UL))
#define FM0P_INTREQ_IRQ31MON                      *((volatile uint32_t*)(0x40031280UL))

